Revit 2027 API
SynchronizeWithCentralOptions.RelinquishFamilyWorksets Property
 Indicates whether Revit should relinquish Family worksets after synchronizing with central.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool RelinquishFamilyWorksets { get; }
Public ReadOnly Property RelinquishFamilyWorksets As Boolean
	Get
public:
property bool RelinquishFamilyWorksets {
	bool get ();
}
member RelinquishFamilyWorksets : bool with get
Property Value
Boolean
Remarks
 This is a shortcut to access the value stored in FamilyWorksets.
See Also
Reference
SynchronizeWithCentralOptions Class
Autodesk.Revit.DB Namespace